n5/src/Catalogs/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Employees</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contractor</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeType</name>
    <type>
      <types>EnumRef.EmployeeTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>HourlyCost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HourlyRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Notes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Enums/EmployeeTypes/EmployeeTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EmployeeTypes</name>
  <enumValues>
    <name>Employee</name>
  </enumValues>
  <enumValues>
    <name>Contractor</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Employees/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Function Check () export
	
	fields = mandatoryFields ();
	checkContractor ( fields );
	if ( not checkFields ( fields ) ) then
		return false;
	endif; 
	if ( not PhoneTemplates.Check ( ThisObject, "BusinessPhone, Fax" ) ) then
		return false;
	endif; 
	return true;
	
EndFunction 

Function mandatoryFields ()
	
	fields = new Array ();
	yes = FillChecking.ShowError;
	for each item in Metadata.Catalogs.Employees.Attributes do
		if ( item.FillChecking = yes ) then
			fields.Add ( item );
		endif;
	enddo; 
	return fields;
	
EndFunction 

Procedure checkContractor ( Fields )
	
	if ( EmployeeType = Enums.EmployeeTypes.Contractor ) then
		Fields.Add ( Metadata.Catalogs.Employees.Attributes.Contractor );
	endif; 
	
EndProcedure 

Function checkFields ( Fields )
	
	errors = findErrors ( Fields );
	if ( errors.Count () = 0 ) then
		return true;
	endif;
	for each error in errors do
		Output.FieldIsEmpty ( new Structure ( "Field", error.Presentation () ), error.Name, , "Employee" );
	enddo;
	return false;
	
EndFunction 

Function findErrors ( Fields )
	
	errors = new Array ();
	for each field in Fields do
		if ( not ValueIsFilled ( ThisObject [ field.Name ] ) ) then
			errors.Add ( field );
		endif; 
	enddo; 
	return errors;
	
EndFunction 

#endif
